app/Controllers/Nilai.php

    public function index()
    {

        $nilaiTertinggi = $this->tableNilai->builder('nilai')->selectMax('rata_rata', 'nilai_tertinggi')
            ->get()->getResultArray();
        $nilaiTerkecil = $this->tableNilai->builder('nilai')->selectMin('rata_rata', 'nilai_terkecil')
            ->get()->getResultArray();
        $dataNilai = $this->tableNilai->builder('nilai n')->join('mahasiswa m', 'm.nim=n.nim_mahasiswa')
            ->join('matakuliah mt', 'mt.kode_matkul=n.id_matkul')->get()->getResultArray();
---
SELECT MAX(`rata_rata`) AS `nilai_tertinggi`
FROM `nilai`
SELECT MIN(`rata_rata`) AS `nilai_terkecil`
FROM `nilai`
SELECT *
FROM `nilai` `n`
JOIN `mahasiswa` `m` ON `m`.`nim`=`n`.`nim_mahasiswa`
JOIN `matakuliah` `mt` ON `mt`.`kode_matkul`=`n`.`id_matkul`

    public function formNilai()
    {

        $tableMahasiswa = new ModelMahasiswa();
        $tableMatakuliah = new ModelMatakuliah();
        $data = [
            'title' => 'Form Nilai',
            'mahasiswa' => $tableMahasiswa->findAll(),
            'matakuliah' => $tableMatakuliah->findAll()
---
SELECT *
FROM `mahasiswa`
SELECT *
FROM `matakuliah`

            session()->setFlashdata('error', $validation->listErrors());
            return redirect()->back()->withInput();
        } else {
            $this->tableNilai->insert([
                'nim_mahasiswa' => $nim,
                'id_matkul' => $matakuliah,
                'nilai_uts' => $nilai_uts,
                'nilai_uas' => $nilai_uas,
                'nilai_tugas' => $nilai_tugas,
                'rata_rata' => $rata_rata
            ]);
---
INSERT INTO `nilai` (`nim_mahasiswa`, `id_matkul`, `nilai_uts`, `nilai_uas`, `nilai_tugas`, `rata_rata`) VALUES ('19221434', 'AK', '66', '40', '95', 67)